szymonsasin-nordic/sdk-nrf/applications/nrf9160dk_demo/src/main.c
	ui_led_set_pattern(UI_LED_ERROR_CLOUD);
	shutdown_modem();
	k_thread_suspend(k_current_get());
}

/**@brief Recoverable BSD library error. */
void bsd_recoverable_error_handler(uint32_t err)
{
	error_handler(ERROR_BSD_RECOVERABLE, (int)err);
}

/**@brief Reboot the device if CONNACK has not arrived. */
static void cloud_reboot_handler(struct k_work *wbuilork)
{
	error_handler(ERROR_CLOUD, -ETIMEDOUT);
}

/**@brief Send button presses to cloud */
static void button_send(uint8_t button_num, bool pressed)
{
	static char data[3];

	if (!data_send_enabled()) {
		return;
	}

	data[0] = button_num + '0';
	if (pressed) {
		data[1] = '1';
	} else {
		data[1] = '0';
	}
	data[2] = '\0';

	button_cloud_data.data.buf = data;
	button_cloud_data.data.len = strlen(data);
	button_cloud_data.tag += 1;

	if (button_cloud_data.tag == 0) {
		button_cloud_data.tag = 0x1;
	}

	LOG_INF("Sending button event for button %d=%s", button_num,
		pressed ? "pressed" : "released");

	/* Submit this to the work queue, so we can return to the caller
	 * quickly.  A separate thread will process this using the callback
	 * @fn send_button_data_work_fn associated with send_button_data_work.
	 */
	k_work_submit_to_queue(&application_work_q, &send_button_data_work);

	if ((button_num == 4) && pressed) {
		send_signon_message();
	}
}

/**@brief Called by the application work queue, this function will actually
 * actually the button press data to the cloud.
 */
static void send_button_data_work_fn(struct k_work *work)
{
	sensor_data_send(&button_cloud_data);
}

/**@brief Send a text message to the cloud; work function
 * will need to free the duplicated string; duplication is done
 * in case message is in a temporary buffer
 */
static void msg_send(const char *message)
{
	if (!data_send_enabled()) {
		return;
	}

	msg_cloud_data.data.buf = strdup(message);
	msg_cloud_data.data.len = strlen(message);
	msg_cloud_data.tag += 1;

	if (msg_cloud_data.tag == 0) {
		msg_cloud_data.tag = 0x1;
	}

	LOG_INF("Sending message: %s", message);
	k_work_submit_to_queue(&application_work_q, &send_msg_data_work);
}

static void send_msg_data_work_fn(struct k_work *work)
{
	sensor_data_send(&msg_cloud_data);
}

/** @brief Send helpful text to 9160DK user in nRFCloud
 *         Terminal card.
 */
static void send_signon_message(void)
{
	msg_send(
	     "**Welcome to the Nordic Semiconductor nrf9160 Development Kit**\n"
	     "  1. Change buttons or switches to receive messages below.\n"
	     "  2. Type commands in the Send a message box:\n"
	     "       Use the state array [LED1,LED2] to turn on(1) or off(0).\n"
	     "       For example, to set LED1 on and LED2 off:\n"
	     "          {\"appId\":\"LED\",\n"
	     "           \"messageType\":\"CFG_SET\",\n"
	     "           \"data\":{\"state\":[1,0]}}\n"
	     "  3. Use the FOTA update service to try out other examples.\n"
	     "  Getting started can be found here: https://bit.ly/32tXBnD");
}


/**@brief Summarize device info and send data to the cloud. */
static void device_status_send(struct k_work *work)
{
	struct modem_param_info *modem_ptr = NULL;
	int ret;

	if (!data_send_enabled()) {
		return;
	}

	ret = modem_info_params_get(&modem_param);
	if (ret < 0) {
		LOG_ERR("Unable to obtain modem parameters: %d", ret);
	} else {
		modem_ptr = &modem_param;
	}

	const char *const ui[] = {
		CLOUD_CHANNEL_STR_BUTTON,
		CLOUD_CHANNEL_STR_MSG,
	};

	const char *const fota[] = {
		SERVICE_INFO_FOTA_STR_APP,
		SERVICE_INFO_FOTA_STR_MODEM
	};

	struct cloud_msg msg = {
		.qos = CLOUD_QOS_AT_MOST_ONCE,
		.endpoint.type = CLOUD_EP_TOPIC_STATE
	};

	ret = cloud_encode_device_status_data(modem_ptr,
					      ui, ARRAY_SIZE(ui),
					      fota, ARRAY_SIZE(fota),
					      SERVICE_INFO_FOTA_VER_CURRENT,
					      &msg);
	if (ret) {
		LOG_ERR("Unable to encode cloud data: %d", ret);
	} else {
		/* Transmits the data to the cloud. */
		ret = cloud_send(cloud_backend, &msg);
		cloud_release_data(&msg);
		if (ret) {
			LOG_ERR("sensor_data_send failed: %d", ret);
			cloud_error_handler(ret);
		}
	}
}

/**@brief Send sensor data to nRF Cloud. */
static void sensor_data_send(struct cloud_channel_data *data)
{
	int err = 0;
	struct cloud_msg msg = {
			.qos = CLOUD_QOS_AT_MOST_ONCE,
			.endpoint.type = CLOUD_EP_TOPIC_MSG
		};

	if (!data_send_enabled()) {
		return;
	}

	err = cloud_encode_data(data, CLOUD_CMD_GROUP_DATA, &msg);
	if (err) {
		LOG_ERR("Unable to encode cloud data: %d", err);
	} else {
		err = cloud_send(cloud_backend, &msg);
		cloud_release_data(&msg);
		if (err) {
			LOG_ERR("%s failed: %d", __func__, err);
			cloud_error_handler(err);
		}
	}
}

/**@brief Initializes the only sensor used by the application. */
static void button_sensor_init(void)
{
	button_cloud_data.type = CLOUD_CHANNEL_BUTTON;
	button_cloud_data.tag = 0x1;
}

/**@brief User interface event handler. */
static void ui_evt_handler(struct ui_evt evt)
{
	/* Send information to cloud about which button generated the event,
	 * as well as whether it was activated or deactivated.
	 */
	button_send(evt.button, evt.type == UI_EVT_BUTTON_ACTIVE ? 1 : 0);
}

/**brief Initialize LTE status containers. */
static void modem_data_init(void)
{
	int err;
	err = modem_info_init();
	if (err) {
		LOG_ERR("Modem info could not be established: %d", err);
		return;
	}

	modem_info_params_init(&modem_param);
}

static bool data_send_enabled(void)
{
	return (atomic_get(&cloud_association) ==
		   CLOUD_ASSOCIATION_STATE_READY);
}

static void connect_to_cloud(const int32_t connect_delay_s)
{
	static bool initial_connect = true;

	/* Ensure no data can be sent to cloud before connection is established.
	 */
	atomic_set(&cloud_association, CLOUD_ASSOCIATION_STATE_INIT);

	if (atomic_get(&carrier_requested_disconnect)) {
		/* A disconnect was requested to free up the TLS socket
		 * used by the cloud.  If enabled, the carrier library
		 * (CONFIG_LWM2M_CARRIER) will perform FOTA updates in
		 * the background and reboot the device when complete.
		 */
		return;
	}

	atomic_inc(&cloud_connect_attempts);

	/* Check if max cloud connect retry count is exceeded. */
	if (atomic_get(&cloud_connect_attempts) >
	    CONFIG_CLOUD_CONNECT_COUNT_MAX) {
		LOG_ERR("The max cloud connection attempt count exceeded.");
		cloud_error_handler(-ETIMEDOUT);
	}

